[
  {
    "name": "Incline Hammer Curls",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position. Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary. Continue to the top of the movement and pause, then slowly return to the start position.",
    "video_url": "https://www.youtube.com/watch?v=cbRSu8Ws_hs"
  },
  {
    "name": "Wide-grip barbell curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Stand up with your torso upright while holding a barbell at the wide outer handle. The palm of your hands should be facing forward. The elbows should be close to the torso. This will be your starting position. While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard. Slowly begin to bring the bar back to starting position as your breathe in. Repeat for the recommended amount of repetitions.  Variations:  You can also perform this movement using an E-Z bar or E-Z attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the closer grip for variety purposes.",
    "video_url": "https://www.youtube.com/watch?v=crk9ZzNAG_Q"
  },
  {
    "name": "EZ-bar spider curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Start out by setting the bar on the part of the preacher bench that you would normally sit on. Make sure to align the barbell properly so that it is balanced and will not fall off. Move to the front side of the preacher bench (the part where the arms usually lay) and position yourself to lay at a 45 degree slant with your torso and stomach pressed against the front side of the preacher bench. Make sure that your feet (especially the toes) are well positioned on the floor and place your upper arms on top of the pad located on the inside part of the preacher bench. Use your arms to grab the barbell with a supinated grip (palms facing up) at about shoulder width apart or slightly closer from each other. Slowly begin to lift the barbell upwards and exhale. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the barbell back to the starting position as your breathe in. . Repeat for the recommended amount of repetitions.  Variation: You can also use dumbbells when performing this exercise. Just make sure you place the dumbbells on the part of the preacher bench where you would normally sit properly.",
    "video_url": "https://www.youtube.com/watch?v=oonD1AUYtSg"
  },
  {
    "name": "Hammer Curls",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso. The palms of the hands should be facing your torso. This will be your starting position. Now, while holding your upper arm stationary, exhale and curl the weight forward while contracting the biceps. Continue to raise the weight until the biceps are fully contracted and the dumbbell is at shoulder level. Hold the contracted position for a brief moment as you squeeze the biceps. Tip: Focus on keeping the elbow stationary and only moving your forearm. After the brief pause, inhale and slowly begin the lower the dumbbells back down to the starting position. Repeat for the recommended amount of repetitions.  Variations: There are many possible variations for this movement. For instance, you can perform the exercise sitting down on a bench with or without back support and you can also perform it by alternating arms; first lift the right arm for one repetition, then the left, then the right, etc.",
    "video_url": "https://www.youtube.com/watch?v=zC3nLlEvin4"
  },
  {
    "name": "EZ-Bar Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "e-z_curl_bar",
    "difficulty": "intermediate",
    "instructions": "Stand up straight while holding an EZ curl bar at the wide outer handle. The palms of your hands should be facing forward and slightly tilted inward due to the shape of the bar. Keep your elbows close to your torso. This will be your starting position. Now, while keeping your upper arms stationary, exhale and curl the weights forward while contracting the biceps. Focus on only moving your forearms. Continue to raise the weight until your biceps are fully contracted and the bar is at shoulder level. Hold the top contracted position for a moment and squeeze the biceps. Then inhale and slowly lower the bar back to the starting position. Repeat for the recommended amount of repetitions.  Variations: You can also perform this movement using an E-Z attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the closer grip for variety purposes.",
    "video_url": "https://www.youtube.com/watch?v=zG2xJ0Q5QtI"
  },
  {
    "name": "Zottman Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "None",
    "difficulty": "intermediate",
    "instructions": "Stand up with your torso upright and a dumbbell in each hand being held at arms length. The elbows should be close to the torso. Make sure the palms of the hands are facing each other. This will be your starting position. While holding the upper arm stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Your wrist should rotate so that you have a supinated (palms up) grip. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Now during the contracted position, rotate your wrist until you now have a pronated (palms facing down) grip with the thumb at a higher position than the pinky. Slowly begin to bring the dumbbells back down using the pronated grip. As the dumbbells close your thighs, start rotating the wrist so that you go back to a neutral (palms facing your body) grip. Repeat for the recommended amount of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=ZrpRBgswtHs"
  },
  {
    "name": "Biceps curl to shoulder press",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Begin in a standing position with a dumbbell in each hand. Your arms should be hanging at your sides with your palms facing forward. Look directly ahead, keeping your chest up, with your feet shoulder-width apart. This will be your starting position. Initiate the movement by flexing the elbows to curl the weight. Do not use momentum or flex through the shoulder, instead use a controlled motion. Execute the pressing movement by extending the arm, flexing and abducting the shoulder to rotate the arm as you press above your head. Pause at the top of the motion before reversing the movement to return to the starting position. Complete the desired number of repetitions before switching to the opposite side.",
    "video_url": "https://m.youtube.com/watch?v=0qER1IjPNbU"
  },
  {
    "name": "Barbell Curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Stand up with your torso upright while holding a barbell at a shoulder-width grip. The palm of your hands should be facing forward and the elbows should be close to the torso. This will be your starting position. While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard. Slowly begin to bring the bar back to starting position as your breathe in. Repeat for the recommended amount of repetitions.  Variations:  You can also perform this movement using a straight bar attachment hooked to a low pulley. This variation seems to really provide a good contraction at the top of the movement. You may also use the closer grip for variety purposes.",
    "video_url": "https://www.youtube.com/watch?v=kwG2ipFRgfo"
  },
  {
    "name": "Concentration curl",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "intermediate",
    "instructions": "Sit down on a flat bench with one dumbbell in front of you between your legs. Your legs should be spread with your knees bent and feet on the floor. Use your right arm to pick the dumbbell up. Place the back of your right upper arm on the top of your inner right thigh. Rotate the palm of your hand until it is facing forward away from your thigh. Tip: Your arm should be extended and the dumbbell should be above the floor. This will be your starting position. While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Tip: At the top of the movement make sure that the little finger of your arm is higher than your thumb. This guarantees a good contraction. Hold the contracted position for a second as you squeeze the biceps. Slowly begin to bring the dumbbells back to starting position as your breathe in. Caution: Avoid swinging motions at any time. Repeat for the recommended amount of repetitions. Then repeat the movement with the left arm.  Variations: This exercise can be performed standing with the torso bent forward and the arm in front of you. In this case, no leg support is used for the back of your arm so you will need to make extra effort to ensure no movement of the upper arm. This is a more challenging version of the exercise and is not recommended for people with lower back issues.",
    "video_url": "https://www.youtube.com/watch?v=Jvj2wV0vOYU"
  },
  {
    "name": "Flexor Incline Dumbbell Curls",
    "type": "strength",
    "muscle": "biceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Hold the dumbbell towards the side farther from you so that you have more weight on the side closest to you. (This can be done for a good effect on all bicep dumbbell exercises). Now do a normal incline dumbbell curl, but keep your wrists as far back as possible so as to neutralize any stress that is placed on them. Sit on an incline bench that is angled at 45-degrees while holding a dumbbell on each hand. Let your arms hang down on your sides, with the elbows in, and turn the palms of your hands forward with the thumbs pointing away from the body. Tip: You will keep this hand position throughout the movement as there should not be any twisting of the hands as they come up. This will be your starting position. Curl up the two dumbbells at the same time until your biceps are fully contracted and exhale. Tip: Do not swing the arms or use momentum. Keep a controlled motion at all times. Hold the contracted position for a second at the top. As you inhale, slowly go back to the starting position. Repeat for the recommended amount of repetitions.  Caution: Do not extend your arms totally as you could injure your elbows if you hyperextend them. Also, make sure that on the way down you move slowly to avoid injury. Variations: You can use cables for this movement as well.",
    "video_url": "https://www.youtube.com/watch?v=cjnaJSYbG3g"
  },
  {
    "name": "Tricep Dumbbell Kickback",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Stand up straight with a dumbbell in each hand at arm's length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing each other. This will be your starting position. Now, while keeping your upper arms stationary, exhale and use your triceps to lift the weights until the arm is fully extended. Focus on moving the forearm. After a brief pause at the top contraction, inhale and slowly lower the dumbbells back to the starting position. Repeat for the recommended amount of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=6SS6K3lAwZ8"
  },
  {
    "name": "Overhead Dumbbell Tricep Extension",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "dumbbell",
    "difficulty": "beginner",
    "instructions": "Sit on a bench with back support and hold a dumbbell with both hands above your head, arms fully extended. Keep your feet firmly on the ground. This will be your starting position. Lower the dumbbell behind your head slowly and with control, bending your elbows until they are at a 90-degree angle. Your upper arms should remain still and your elbows should be the only joints moving. Pause for a moment, then extend your elbows to raise the dumbbell back to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=EWs4Qc1_zk4"
  },
  {
    "name": "Tricep Dip",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "parallel_bars",
    "difficulty": "beginner",
    "instructions": "Position your hands shoulder-width apart on a secured bench or stable surface. Slide your butt off the front of the bench with your legs extended out in front of you. Straighten your arms, keeping a little bend in your elbows to keep tension on your triceps and off your elbow joints. Slowly bend your elbows to lower your body toward the floor until your elbows are at about a 90-degree angle. Press down into the bench to straighten your elbows, returning to the starting position. This completes one rep. Keep your shoulders down as you lower and raise your body. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=6kALZikXxLc"
  },

  {
    "name": "Tricep Pushdown",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "cable_machine",
    "difficulty": "beginner",
    "instructions": "Stand facing the cable machine and grasp the straight bar attachment with an overhand grip, hands shoulder-width apart. Your elbows should be bent at your sides and your upper arms should be parallel to the floor. This is your starting position. Keeping your upper arms stationary, extend your elbows and push the bar down until your arms are fully extended. Pause for a moment, then slowly return to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=hUT8ohwrBYU"
  },
  {
    "name": "Close-Grip Bench Press",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Lie back on a flat bench holding a barbell with a narrow, shoulder-width grip. Lift the bar from the rack and hold it straight over your chest with your arms fully extended. This will be your starting position. Lower the barbell slowly until it almost touches your chest. Pause for a moment, then press the barbell back to the starting position by extending your elbows. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=JQPz-OOwl_Y"
  },
  {
    "name": "Diamond Push-Up",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Start in a plank position with your hands close together, forming a diamond shape with your index fingers and thumbs. Your hands should be directly under your shoulders. Lower your body towards the floor, keeping your elbows close to your sides. Push back up to the starting position, fully extending your arms. Keep your core engaged and your body in a straight line throughout the movement. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=yd-uej2tFNk"
  },
  {
    "name": "Tricep Rope Pushdown",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "cable_machine",
    "difficulty": "beginner",
    "instructions": "Attach a rope attachment to the high pulley of a cable machine. Stand facing the machine and grasp the ends of the rope with an overhand grip. Your elbows should be bent at your sides and your upper arms should be parallel to the floor. This is your starting position. Keeping your upper arms stationary, extend your elbows and push the rope down until your arms are fully extended. Pause for a moment, then slowly return to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=8DbJKT_LY8s"
  },
  {
    "name": "Skull Crushers",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Lie on a flat bench with a barbell in your hands, palms facing up. Extend your arms straight up, holding the barbell above your chest. This will be your starting position. Keeping your upper arms stationary, bend your elbows to lower the barbell towards your forehead. Keep your elbows pointed up towards the ceiling throughout the movement. Pause briefly at the bottom of the movement, then extend your elbows to return to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=u-QvT2_-7FU"
  },
  {
    "name": "Tricep Cable Kickback",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "cable_machine",
    "difficulty": "beginner",
    "instructions": "Attach a single handle to the low pulley of a cable machine. Stand facing the machine with your feet shoulder-width apart and hold the handle with an overhand grip. Bend your knees slightly and hinge forward at the hips, keeping your back straight. This is your starting position. Keeping your upper arm stationary, extend your elbow to push the handle...",
    "video_url": "https://www.youtube.com/watch?v=dNCfSLhg_7s"
  },
  {
    "name": "Tricep Cable Kickback",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "cable_machine",
    "difficulty": "beginner",
    "instructions": "Attach a single handle to the low pulley of a cable machine. Stand facing the machine with your feet shoulder-width apart and hold the handle with an overhand grip. Bend your knees slightly and hinge forward at the hips, keeping your back straight. This is your starting position. Keeping your upper arm stationary, extend your elbow to push the handle back until your arm is fully extended. Pause for a moment, then slowly return to the starting position. Repeat for the recommended number of repetitions, then switch arms.",
    "video_url": "https://www.youtube.com/watch?v=dNCfSLhg_7s"
  },
  {
    "name": "Reverse Grip Tricep Pushdown",
    "type": "strength",
    "muscle": "triceps",
    "equipment": "cable_machine",
    "difficulty": "beginner",
    "instructions": "Stand facing a high pulley cable machine with a straight bar attachment. Grasp the bar with an underhand grip, hands shoulder-width apart. Your elbows should be bent at your sides and your upper arms should be parallel to the floor. This is your starting position. Keeping your upper arms stationary, extend your elbows and push the bar down until your arms are fully extended. Pause for a moment, then slowly return to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=u-QvT2_-7FU"
  },
  {
    "name": "Squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Stand with your feet shoulder-width apart and your toes pointed slightly outward. Hold a barbell across your upper back, resting it on your traps. Keep your chest up and your core engaged. Lower your body by bending at the hips and knees, as if you were sitting back into a chair. Keep your knees in line with your toes and your weight in your heels. Lower yourself until your thighs are parallel to the ground, then push through your heels to return to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=JufYi-dpz_M"
  },
  {
    "name": "Leg Press",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "leg_press_machine",
    "difficulty": "beginner",
    "instructions": "Sit on the leg press machine with your back flat against the backrest and your feet shoulder-width apart on the footplate. Adjust the seat so that your knees are at a 90-degree angle when your legs are fully extended. Grasp the handles on either side of the seat for stability. Push the footplate away from your body by straightening your legs, being careful not to lock your knees. Slowly return to the starting position by bending your knees and bringing the footplate back towards your body. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=PFQupYnMN4o"
  },
  {
    "name": "Squats",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "barbell",
    "difficulty": "beginner",
    "instructions": "Stand with your feet shoulder-width apart, holding a barbell across your upper back. Keeping your chest up and core engaged, lower your body by bending your knees and pushing your hips back as if sitting into a chair. Keep your knees in line with your toes and your weight in your heels. Once your thighs are parallel to the ground, push through your heels to return to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=ultWZbUMPL8"
  },
  {
    "name": "Deadlifts",
    "type": "strength",
    "muscle": "hamstrings",
    "equipment": "barbell",
    "difficulty": "intermediate",
    "instructions": "Stand with your feet hip-width apart, toes under the barbell. Bend at your hips and knees, keeping your spine neutral and chest up, to grip the barbell with hands slightly wider than shoulder-width apart. Engage your core and lift the bar by straightening your hips and knees. Keep the bar close to your body as you stand up. Reverse the movement to lower the bar back to the ground. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=XxWcirHIwVo"
  },
  {
    "name": "Lunges",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "none",
    "difficulty": "beginner",
    "instructions": "Stand with your feet hip-width apart and your hands on your hips. Take a large step forward with your right foot and lower your body until your right thigh is parallel to the ground and your left knee is just above the floor. Your front knee should be directly above your ankle, and your back knee should be pointing toward the ground. Push through your right heel to return to the starting position. Repeat on the other side, alternating legs for the recommended number of repetitions.",
    "video_url": "https://m.youtube.com/watch?v=wrwwXE_x-pQ"
  },
  {
    "name": "Leg Extension",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "leg_extension_machine",
    "difficulty": "beginner",
    "instructions": "Sit on the leg extension machine with your back against the backrest and your feet hooked under the footpad. Adjust the seat so that the knee joint lines up with the pivot point of the machine. Grasp the handles on either side of the seat for stability. Extend your legs to lift the weight until your legs are fully straightened, then slowly lower the weight back down to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=YyvSfVjQeL0"
  },
  {
    "name": "Step-Up",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "bench",
    "difficulty": "beginner",
    "instructions": "Stand in front of a bench or step with your feet hip-width apart. Place your right foot on the bench, making sure your entire foot is on the surface. Press through your right heel and step up onto the bench, bringing your left foot to meet your right. Step back down with your left foot, followed by your right. Repeat for the recommended number of repetitions, then switch legs.",
    "video_url": "https://www.youtube.com/watch?v=dQqApCGd5Ss"
  },
  {
    "name": "Hack Squat",
    "type": "strength",
    "muscle": "quadriceps",
    "equipment": "hack_squat_machine",
    "difficulty": "intermediate",
    "instructions": "Stand with your back against the backrest of the hack squat machine and your feet shoulder-width apart on the platform. Position your shoulders under the shoulder pads and grasp the handles for stability. Lower your body by bending at the knees and hips, keeping your chest up and your core engaged. Push through your heels to return to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=0tn5K9NlCfo"
  },
  {
    "name": "Leg Press Calf Raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "leg_press_machine",
    "difficulty": "beginner",
    "instructions": "Sit on the leg press machine with your back flat against the backrest and your feet shoulder-width apart on the footplate. Adjust the seat so that your knees are at a 90-degree angle when your legs are fully extended. Grasp the handles on either side of the seat for stability. Push the footplate away from your body by straightening your legs, then press through the balls of your feet to raise your heels as high as possible. Lower your heels back down to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://m.youtube.com/watch?v=Hu8i9d_IgpM"
  },
  {
    "name": "Standing Calf Raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "calf_raise_machine",
    "difficulty": "beginner",
    "instructions": "Stand with the balls of your feet on a calf raise machine platform and your shoulders under the pads. Grasp the handles for stability. Raise your heels as high as possible by pushing through the balls of your feet, then lower your heels back down to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=k67UjgvJdEk"
  },
  {
    "name": "Seated Calf Raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "seated_calf_raise_machine",
    "difficulty": "beginner",
    "instructions": "Sit on a seated calf raise machine with your feet on the platform and your knees bent at a 90-degree angle. Adjust the machine so that your knees are in line with the pivot point. Place your thighs under the pads and grasp the handles for stability. Raise your heels as high as possible by pushing through the balls of your feet, then lower your heels back down to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=3ZRe_QpvRPg"
  },
  {
    "name": "Donkey Calf Raise",
    "type": "strength",
    "muscle": "calves",
    "equipment": "donkey_calf_raise_machine",
    "difficulty": "intermediate",
    "instructions": "Position yourself on a donkey calf raise machine, bending at the waist so that your hips are at a 90-degree angle. Place your feet on the platform and grasp the handles for stability. Raise your heels as high as possible by pushing through the balls of your feet, then lower your heels back down to the starting position. Repeat for the recommended number of repetitions.",
    "video_url": "https://www.youtube.com/watch?v=yEAi8wec5ZM"
  }
]
